genestealer/everblu-meters-esp8266-improved/src/main.cpp
// JSON Discovery for Uptime
// This is used to show the uptime of the device in Home Assistant
const char jsonDiscoveryUptime[] PROGMEM = R"rawliteral(
{
  "name": "Device Uptime",
  "uniq_id": "water_meter_uptime",
  "obj_id": "water_meter_uptime",
  "dev_cla": "timestamp",
  "qos": 0,
  "avty_t": "everblu/cyble/status",
  "stat_t": "everblu/cyble/uptime",
  "frc_upd": true,
  "ent_cat": "diagnostic",
  "dev": {
    "ids": ["14071984"],
    "name": "Water Meter",
    "mdl": "Itron EverBlu Cyble Enhanced Water Meter ESP8266/ESP32",
    "mf": "Psykokwak [Forked by Genestealer]"
  }
}
)rawliteral";

// JSON Discovery for Restart Button
// This is used to trigger a restart of the device when pressed in Home Assistant
const char jsonDiscoveryRestartButton[] PROGMEM = R"rawliteral(
{
  "name": "Restart Device",
  "uniq_id": "water_meter_restart",
  "obj_id": "water_meter_restart",
  "qos": 0,
  "avty_t": "everblu/cyble/status",
  "cmd_t": "everblu/cyble/restart",
  "pl_prs": "restart",
  "ent_cat": "config",
  "dev": {
    "ids": ["14071984"],
    "name": "Water Meter",
    "mdl": "Itron EverBlu Cyble Enhanced Water Meter ESP8266/ESP32",
    "mf": "Psykokwak [Forked by Genestealer]"
  }
}
)rawliteral";

// JSON Discovery for Meter Year
const char jsonDiscoveryMeterYear[] PROGMEM = R"rawliteral(
{
  "name": "Meter Year",
  "uniq_id": "water_meter_year",
  "obj_id": "water_meter_year",
  "ic": "mdi:calendar",
  "qos": 0,
  "avty_t": "everblu/cyble/status",
  "stat_t": "everblu/cyble/water_meter_year",
  "frc_upd": true,
  "ent_cat": "diagnostic",
  "dev": {
    "ids": ["14071984"],
    "name": "Water Meter",
    "mdl": "Itron EverBlu Cyble Enhanced Water Meter ESP8266/ESP32",
    "mf": "Psykokwak [Forked by Genestealer]"
  }
}
)rawliteral";

// JSON Discovery for Meter Serial
const char jsonDiscoveryMeterSerial[] PROGMEM = R"rawliteral(
{
  "name": "Meter Serial",
  "uniq_id": "water_meter_serial",
  "obj_id": "water_meter_serial",
  "ic": "mdi:barcode",
  "qos": 0,
  "avty_t": "everblu/cyble/status",
  "stat_t": "everblu/cyble/water_meter_serial",
  "frc_upd": true,
  "ent_cat": "diagnostic",
  "dev": {
    "ids": ["14071984"],
    "name": "Water Meter",
    "mdl": "Itron EverBlu Cyble Enhanced Water Meter ESP8266/ESP32",
    "mf": "Psykokwak [Forked by Genestealer]"
  }
}
)rawliteral";

// JSON Discovery for Reading Schedule
const char jsonDiscoveryReadingSchedule[] PROGMEM = R"rawliteral(
{
  "name": "Reading Schedule",
  "uniq_id": "water_meter_reading_schedule",
  "obj_id": "water_meter_reading_schedule",
  "ic": "mdi:calendar-clock",
  "qos": 0,
  "avty_t": "everblu/cyble/status",
  "stat_t": "everblu/cyble/reading_schedule",
  "frc_upd": true,
  "ent_cat": "diagnostic",
  "dev": {
    "ids": ["14071984"],
    "name": "Water Meter",
    "mdl": "Itron EverBlu Cyble Enhanced Water Meter ESP8266/ESP32",
    "mf": "Psykokwak [Forked by Genestealer]"
  }
}
)rawliteral";

// JSON Discovery for Battery Months Left
const char jsonDiscoveryBatteryMonths[] PROGMEM = R"rawliteral(
{
  "name": "Months Remaining",
  "uniq_id": "water_meter_battery_months",
  "obj_id": "water_meter_battery_months",
  "ic": "mdi:battery-clock",
  "unit_of_meas": "months",
  "stat_cla": "measurement",
  "sug_dsp_prc": 0,
  "qos": 0,
  "avty_t": "everblu/cyble/status",
  "stat_t": "everblu/cyble/battery",
  "frc_upd": true,
  "dev": {
    "ids": ["14071984"],
    "name": "Water Meter",
    "mdl": "Itron EverBlu Cyble Enhanced Water Meter ESP8266/ESP32",
    "mf": "Psykokwak [Forked by Genestealer]"
  }
}
)rawliteral";

// JSON Discovery for Meter RSSI (dBm)
const char jsonDiscoveryMeterRSSIDBm[] PROGMEM = R"rawliteral(
{
  "name": "RSSI",
  "uniq_id": "water_meter_rssi_dbm",
  "obj_id": "water_meter_rssi_dbm",
  "dev_cla": "signal_strength",
  "ic": "mdi:signal",
  "unit_of_meas": "dBm",
  "stat_cla": "measurement",
  "qos": 0,
  "avty_t": "everblu/cyble/status",
  "stat_t": "everblu/cyble/rssi_dbm",
  "frc_upd": true,
  "dev": {
    "ids": ["14071984"],
    "name": "Water Meter",
    "mdl": "Itron EverBlu Cyble Enhanced Water Meter ESP8266/ESP32",
    "mf": "Psykokwak [Forked by Genestealer]"
  }
}
)rawliteral";

// JSON Discovery for Meter RSSI (Percentage)
const char jsonDiscoveryMeterRSSIPercentage[] PROGMEM = R"rawliteral(
{
  "name": "Signal",
  "uniq_id": "water_meter_rssi_percentage",
  "obj_id": "water_meter_rssi_percentage",
  "ic": "mdi:signal-cellular-3",
  "unit_of_meas": "%",
  "stat_cla": "measurement",
  "qos": 0,
  "avty_t": "everblu/cyble/status",
  "stat_t": "everblu/cyble/rssi_percentage",
  "frc_upd": true,
  "dev": {
    "ids": ["14071984"],
    "name": "Water Meter",
    "mdl": "Itron EverBlu Cyble Enhanced Water Meter ESP8266/ESP32",
    "mf": "Psykokwak [Forked by Genestealer]"
  }
}
)rawliteral";

// JSON Discovery for Meter LQI (Link Quality Indicator)
const char jsonDiscoveryLQIPercentage[] PROGMEM = R"rawliteral(
  {
    "name": "Signal Quality (LQI)",
    "uniq_id": "water_meter_lqi_percentage",
    "obj_id": "water_meter_lqi_percentage",
    "ic": "mdi:signal-cellular-outline",
    "unit_of_meas": "%",
    "stat_cla": "measurement",
    "qos": 0,
    "avty_t": "everblu/cyble/status",
    "stat_t": "everblu/cyble/lqi_percentage",
    "frc_upd": true,
    "dev": {
      "ids": ["14071984"],
      "name": "Water Meter",
      "mdl": "Itron EverBlu Cyble Enhanced Water Meter ESP8266/ESP32",
      "mf": "Psykokwak [Forked by Genestealer]"
    }
  }
  )rawliteral";
  
// JSON Discovery for Meter Wake Time
const char jsonDiscoveryTimeStart[] PROGMEM = R"rawliteral(
{
  "name": "Wake Time",
  "uniq_id": "water_meter_time_start",
  "obj_id": "water_meter_time_start",
  "ic": "mdi:clock-start",
  "qos": 0,
  "avty_t": "everblu/cyble/status",
  "stat_t": "everblu/cyble/time_start",
  "frc_upd": true,
  "dev": {
    "ids": ["14071984"],
    "name": "Water Meter",
    "mdl": "Itron EverBlu Cyble Enhanced Water Meter ESP8266/ESP32",
    "mf": "Psykokwak [Forked by Genestealer]"
  }
}
)rawliteral";

// JSON Discovery for Meter Sleep Time
const char jsonDiscoveryTimeEnd[] PROGMEM = R"rawliteral(
{
  "name": "Sleep Time",
  "uniq_id": "water_meter_time_end",
  "obj_id": "water_meter_time_end",
  "ic": "mdi:clock-end",
  "qos": 0,
  "avty_t": "everblu/cyble/status",
  "stat_t": "everblu/cyble/time_end",
  "frc_upd": true,
  "dev": {
    "ids": ["14071984"],
    "name": "Water Meter",
    "mdl": "Itron EverBlu Cyble Enhanced Water Meter ESP8266/ESP32",
    "mf": "Psykokwak [Forked by Genestealer]"
  }
}
)rawliteral";




// Function: publishWifiDetails
// Description: Publishes Wi-Fi diagnostics (IP, RSSI, signal strength, etc.) to MQTT.
void publishWifiDetails() {
  Serial.println("> Publish Wi-Fi details");
  String wifiIP = WiFi.localIP().toString();
  int wifiRSSI = WiFi.RSSI();
  int wifiSignalPercentage = calculateWiFiSignalStrengthPercentage(wifiRSSI); // Convert RSSI to percentage
  String macAddress = WiFi.macAddress();
  String wifiSSID = WiFi.SSID();
  String wifiBSSID = WiFi.BSSIDstr();
  String status = (WiFi.status() == WL_CONNECTED) ? "online" : "offline";

  // Uptime calculation
  unsigned long uptimeMillis = millis();
  time_t uptimeSeconds = uptimeMillis / 1000;
  time_t now = time(nullptr);
  time_t uptimeTimestamp = now - uptimeSeconds;
  char uptimeISO[32];
  strftime(uptimeISO, sizeof(uptimeISO), "%FT%TZ", gmtime(&uptimeTimestamp));

